IDEA StatiCa Open Model
CrossSectionFactory.FillCHSPar Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Circular hollow section - steel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillCHSPar(
	CrossSectionParameter css,
	double D,
	double t
)
Public Shared Sub FillCHSPar (
	css As CrossSectionParameter,
	D As Double,
	t As Double
)
public:
static void FillCHSPar(
	CrossSectionParameter^ css,
	double D,
	double t
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
D
Type: System.Double
Diameter
t
Type: System.Double
thickness
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace